app/Controllers/DashboardAdmin.php

SELECT *
FROM `Reservation`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `Reservation`
SELECT *
FROM `typeHebergement`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `typeHebergement`
SELECT *
FROM `Client`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `Client`
---
    public function index()
    {
        $this->modalReservations = new TypeHebergement();
        $this->modalClient = new DatabaseModel();
        $data = [
            'hebergements' => $this->modalReservations->paginate(),
            'clients' => $this->modalClient->paginate(),

        ];

SELECT *
FROM `Reservation`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `Reservation`
SELECT *
FROM `typeHebergement`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `typeHebergement`
---
    public function AfficherReservation()
    {
        $this->modalType = new TypeHebergement();
        $this->modalClient = new DatabaseModel();
        $this->modalReservation = new ReservationModel();
        $data = [
            'nbPersonnes' => $this->modalReservation->paginate(),
            'clients' => $this->modalClient->paginate(),
            'hebergements' => $this->modalType->paginate(),
        ];

SELECT *
FROM `Client`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `Client`
---
    public function users(){
        $this->modalClients = new DatabaseModel();
        $data = [
            'clients' => $this->modalClients->paginate(),

        ];