app/Controllers/DashboardUser.php

    public function index()
    {
        $this->modal = new DatabaseModel();

        $session = \Config\Services::session();
        $id = $session->get('idClient');
        $data['logins'] = $this->modal->find($id);
---
SELECT *
FROM `Client`
WHERE `Client`.`idClient` = '1'

    public function reservation()
    {
        $this->modalReservations = new TypeHebergement();
        $this->modalClient = new DatabaseModel();
        $data = [
            'hebergements' => $this->modalReservations->paginate(),
            'clients' => $this->modalClient->paginate(),

        ];
---
SELECT *
FROM `Client`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `Client`
SELECT *
FROM `typeHebergement`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `typeHebergement`