app/Controllers/Home.php

SELECT *
FROM `typeHebergement`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `typeHebergement`
SELECT *
FROM `Client`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `Client`
---
    public function index()
    {
        $this->modalReservations = new TypeHebergement();
        $this->modalClient = new DatabaseModel();
        $data = [
            'hebergements' => $this->modalReservations->paginate(),
            'clients' => $this->modalClient->paginate(),

        ];